KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Гурьев 01.09.23 Гурьев Вывод реквизита "Комментарий к заказу"
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ТоварыПоРаспоряжениямКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.ТоварыПоРаспоряжениям); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.ТоварыПоРаспоряжениям.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ОтгружаемыеТоварыКомментарийКЗаказу", Тип("ПолеФормы"), Элементы.ОтгружаемыеТовары); 
	КолонкаКомментарийКЗаказу.Заголовок = "Комментарий к заказу"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.ОтгружаемыеТовары.КАНАТ_КомментарийКЗаказу";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//-- Гурьев 01.09.23
	
	//++ Гурьев 31.08.23 Создание новых элементов формы для отображения свода товаров
	
	СтраницаСводТоваров = Элементы.Добавить(
		"КАНАТ_СтранциаСводТоваров",
		Тип("ГруппаФормы"),
		Элементы.ГруппаСтраницы);
	СтраницаСводТоваров.Вид = ВидГруппыФормы.Страница;
	СтраницаСводТоваров.Заголовок = "Товары свод";
	
	ДобавляемыеРеквизиты = Новый Массив;
	//Таблица Товары Свод
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КАНАТ_ТЗСводТоваров",
															 Новый ОписаниеТипов("ТаблицаЗначений")));
	
	//Колонки
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номер",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "№"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Код",
															 Новый ОписаниеТипов("Строка"),
															 "КАНАТ_ТЗСводТоваров",
															 "Код"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НоменклатураСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),
															 "КАНАТ_ТЗСводТоваров",
															 "Номенклатура"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ХарактеристикаСсылка",
															 Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
															 "КАНАТ_ТЗСводТоваров",
															 "Характеристика"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Количество",
															 Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)),
															 "КАНАТ_ТЗСводТоваров",
															 "Количество"));
	//БИТ_Гурьев_ДобавитьКоличествоПоРаспоряжению_20.03.24++
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КоличествоПоРаспоряжению",
															 Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)),
															 "КАНАТ_ТЗСводТоваров",
															 "Количество"));
	//БИТ_Гурьев_ДобавитьКоличествоПоРаспоряжению_20.03.24--
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Вес",
															 Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)),
															 "КАНАТ_ТЗСводТоваров",
															 "Вес"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕдиницаИзмерения",
															 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"),
															 "КАНАТ_ТЗСводТоваров",
															 "Ед. изм."));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Серии",
															 Новый ОписаниеТипов("Число"),
															 "КАНАТ_ТЗСводТоваров",
															 "Мест"));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Элементы формы Свод Таблица
	ТаблицаФормы = Элементы.Добавить("КАНАТ_ТЗСводТоваров", Тип("ТаблицаФормы"), Элементы.КАНАТ_СтранциаСводТоваров);
	ТаблицаФормы.ПутьКДанным = "КАНАТ_ТЗСводТоваров"; 
	ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ТаблицаФормы.ТолькоПросмотр = Истина;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомер", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "№"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Номер";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКод", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Код"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Код";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНоменклатура", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Номенклатура"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.НоменклатураСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровХарактеристика", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Характеристика"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ХарактеристикаСсылка";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКоличество", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Количество"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Количество";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	//БИТ_Гурьев_ДобавитьКоличествоПоРаспоряжению_20.03.24++
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровКоличествоПоРаспоряжению", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Количество по распоряжению"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.КоличествоПоРаспоряжению";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	//БИТ_Гурьев_ДобавитьКоличествоПоРаспоряжению_20.03.24--
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровВес", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Вес"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Вес";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровЕдиницаИзмерения", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Ед. изм."; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.ЕдиницаИзмерения";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	НоваяКолонка = Элементы.Добавить("КАНАТ_ТЗСводТоваровНомерСерии", Тип("ПолеФормы"), Элементы.КАНАТ_ТЗСводТоваров); 
	НоваяКолонка.Заголовок = "Мест"; 
	НоваяКолонка.ПутьКДанным = "КАНАТ_ТЗСводТоваров.Серии";
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	
	КАНАТ_ОбновитьТоварыСвод();
	
	//-- Гурьев 31.08.23
	
	//БИТ_Гурьев_ЧТЗ_2.7++
	Элементы.ОтгружаемыеТоварыКоличествоУпаковок.ТолькоПросмотр = Истина;
	
	ВсегоСерий = Элементы.Добавить("КАНАТ_ВсегоСерий", Тип("ПолеФормы"), Элементы.ГруппаПодвал); 
	ВсегоСерий.Заголовок = "Всего мест"; 
	ВсегоСерий.ПутьКДанным = "Объект.КАНАТ_ВсегоСерий";
	ВсегоСерий.Вид = ВидПоляФормы.ПолеНадписи;
	//БИТ_Гурьев_ЧТЗ_2.7--
	
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
	КАНАТ_ОбновитьКоличествоСерий();
	Элементы.ДекорацияМест.Заголовок = "";
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24--
	
	//БИТ_Гурьев_Добавление сертификата в таблицы_04.04.24++
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ТоварыПоРаспоряжениямСертификат", Тип("ПолеФормы"), Элементы.ТоварыПоРаспоряжениям); 
	КолонкаКомментарийКЗаказу.Заголовок = "Сертификат"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.ТоварыПоРаспоряжениям.КАНАТ_Сертификат";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	
	КолонкаКомментарийКЗаказу = Элементы.Добавить("КАНАТ_ОтгружаемыеТоварыСертификат", Тип("ПолеФормы"), Элементы.ОтгружаемыеТовары); 
	КолонкаКомментарийКЗаказу.Заголовок = "Сертификат"; 
	КолонкаКомментарийКЗаказу.ПутьКДанным = "Объект.ОтгружаемыеТовары.КАНАТ_Сертификат";
	КолонкаКомментарийКЗаказу.Вид = ВидПоляФормы.ПолеВвода;
	//БИТ_Гурьев_Добавление сертификата в таблицы_04.04.24--
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	//++ Гурьев 31.08.23 Обновление свода товаров при смене страницы
	Если ТекущаяСтраница.Имя = "КАНАТ_СтранциаСводТоваров" Тогда
		КАНАТ_ОбновитьТоварыСвод();
	КонецЕсли;
	//-- Гурьев 31.08.23
КонецПроцедуры

//++ Гурьев 31.08.23 Процедура, обновляющая таблицу ТоварыСвод
&НаСервере
Процедура КАНАТ_ОбновитьТоварыСвод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ВТБезГруппировки
	|ИЗ
	|	&Таблица КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.УпаковочныйЛист = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК НоменклатураСсылка,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаТовары.Вес) КАК Вес,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаТовары.Серия) КАК Серия
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТБезГруппировки КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
	|	ТоварыПоРаспоряжениям.Характеристика КАК Характеристика,
	|	ТоварыПоРаспоряжениям.Количество КАК КоличествоПоРаспоряжению
	|ПОМЕСТИТЬ ВТПоРаспоряжениямБезГруппировки
	|ИЗ
	|	&ТоварыПоРаспоряжениям КАК ТоварыПоРаспоряжениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыПоРаспоряжениямБезГруппировки.Номенклатура КАК НоменклатураСсылка,
	|	ТоварыПоРаспоряжениямБезГруппировки.Характеристика КАК Характеристика,
	|	СУММА(ТоварыПоРаспоряжениямБезГруппировки.КоличествоПоРаспоряжению) КАК КоличествоПоРаспоряжению
	|ПОМЕСТИТЬ ВТПоРаспоряжениям
	|ИЗ
	|	ВТПоРаспоряжениямБезГруппировки КАК ТоварыПоРаспоряжениямБезГруппировки
	|СГРУППИРОВАТЬ ПО
	|	ТоварыПоРаспоряжениямБезГруппировки.Номенклатура,
	|	ТоварыПоРаспоряжениямБезГруппировки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	ВТ.НоменклатураСсылка КАК НоменклатураСсылка,
	|	ВТ.Характеристика КАК ХарактеристикаСсылка,
	|	ВТ.Количество КАК Количество,
	|	ВТ.Вес КАК Вес,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Серия КАК Серии,
	|	ВТПоРаспоряжениям.КоличествоПоРаспоряжению КАК КоличествоПоРаспоряжению
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ.НоменклатураСсылка = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРаспоряжениям КАК ВТПоРаспоряжениям
	|		ПО (ВТ.Характеристика = ВТПоРаспоряжениям.Характеристика И
	|			ВТ.НоменклатураСсылка = ВТПоРаспоряжениям.НоменклатураСсылка)";
	
	Запрос.УстановитьПараметр("Таблица", Объект.ОтгружаемыеТовары.Выгрузить());
	Запрос.УстановитьПараметр("ТоварыПоРаспоряжениям", Объект.ТоварыПоРаспоряжениям.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Счетчик = 0;
	
	ЭтотОбъект.КАНАТ_ТЗСводТоваров.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Счетчик = Счетчик + 1;
		
		Строка = ЭтотОбъект.КАНАТ_ТЗСводТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Номер = Счетчик;
		
	КонецЦикла;
	
КонецПроцедуры 
//-- Гурьев 31.08.23

&НаКлиенте
&После("ОткрытьПодборСерийЗавершение")
Процедура КАНАТ_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
	КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары();
	ЭтотОбъект.ОбновитьОтображениеДанных();
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.КАНАТ_ЗаполнитьКомментарийОтгружаемыеТовары();
	ДокументОбъект.Записать();
	
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОткрытьПодборСерий")
Процедура КАНАТ_ОткрытьПодборСерий(ИмяТЧ, Текст, ТекущиеДанные)
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтотОбъект,ПараметрыУказанияСерий[ИмяТЧ],Текст, ТекущиеДанные) Тогда
		Если ТекущиеДанные = Неопределено Тогда
			ТекущиеДанныеИдентификатор = Элементы[ИмяТЧ].ТекущиеДанные.ПолучитьИдентификатор();
		Иначе
			ТекущиеДанныеИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;

		ПараметрыФормыУказанияСерий = ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ);

		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПодборСерийЗавершение",
		ЭтотОбъект,
		Новый Структура("ИмяТЧ,ПараметрыФормыУказанияСерий", ИмяТЧ,ПараметрыФормыУказанияСерий));
		#Вставка
		//БИТ_Гурьев_ЧТЗ_2.7_19.02.24++
		Если ИмяТЧ = "ОтгружаемыеТовары" и ПроверитьВидНоменклатуры(ТекущиеДанные.Номенклатура) Тогда   
			
			ПараметрыФормыУказанияСерий.ИмяФормы = "Обработка.ПодборСерийВДокументы.Форма.КАНАТ_РегистрацияИПодборСерийПоОднойСтрокеТоваров_РасходныйОрдер";
			ПараметрыФормыУказанияСерий.ТолькоПросмотр = Истина;
	
			ПараметрыФормыУказанияСерий.Вставить("КоличествоКОтгрузке",КАНАТ_ПолучитьКоличествоКОтгрузке(Объект.Ссылка,
																										 ТекущиеДанные.Номенклатура,
																										 ТекущиеДанные.Характеристика));
																											 
		КонецЕсли;
		//БИТ_Гурьев_ЧТЗ_2.7_19.02.24--
		#КонецВставки
		ОткрытьФорму(ПараметрыФормыУказанияСерий.ИмяФормы,
		ПараметрыФормыУказанияСерий,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьВидНоменклатуры(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры.Канат_ЗапретНаОтгрузкуЧастями; 
	
КонецФункции	

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимостьЭлементовУпаковкиПриМаркировке")
Процедура КАНАТ_УстановитьВидимостьЭлементовУпаковкиПриМаркировке()
	
	ВидимостьЭлементов = (ПолучитьФункциональнуюОпцию("ИспользоватьУпаковочныеЛисты")
		И Не ЕстьМаркируемаяПродукция
		И ПравоДоступа("Изменение", Метаданные.Документы.УпаковочныйЛист)
		И ПравоДоступа("Редактирование", Метаданные.Документы.УпаковочныйЛист)
	);
	
	Элементы.ПроверитьКоличество.Заголовок = ?(ВидимостьЭлементов, НСтр("ru = 'Проверить и упаковать';
																		|en = 'Verify and pack'"), НСтр("ru = 'Проверить';
																												|en = 'Check'"));
	#Удаление
	Элементы.ВсегоМест.Видимость = ВидимостьЭлементов;
	Элементы.ДекорацияМест.Видимость = ВидимостьЭлементов;
	#КонецУдаления
	#Вставка
	//БИТ_Гурьев_ЧТЗ_2.7_19.02.24++
	Элементы.ВсегоМест.Видимость = Ложь;
	Элементы.ДекорацияМест.Видимость = Ложь;
	//БИТ_Гурьев_ЧТЗ_2.7_19.02.24--
	#КонецВставки
	
	Элементы.ОтгружаемыеТоварыУпаковочныйЛистКод.Видимость = ВидимостьЭлементов;
	Элементы.ОтгружаемыеТоварыГруппаУпаковочныеЛисты.Видимость = ВидимостьЭлементов;
	
	Элементы.ГруппаРежимПросмотраНавигация.Видимость = ВидимостьЭлементов;
	
	Элементы.ОтгружаемыеТоварыКартинкаУпаковочногоЛиста.Видимость = ВидимостьЭлементов;
	Элементы.ОтгружаемыеТоварыДопИнфоУпаковочныйЛист.Видимость = ВидимостьЭлементов;
	
	Элементы.ОтгружаемыеТоварыУпаковочныйЛист.Видимость = ВидимостьЭлементов;
	Элементы.ОтгружаемыеТоварыНомерСтрокиОтображаемый.Видимость = ВидимостьЭлементов;
	
	Элементы.ОтгружаемыеТоварыУпаковочныйЛистРодитель.Видимость = ВидимостьЭлементов
		И (Объект.РежимПросмотраПоТоварам = 1);
	
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
&НаСервере
Процедура КАНАТ_ОбновитьКоличествоСерий()
	
	КоличествоСерий = 0;
	
	Массив = Новый Массив;
	
	Для Каждого Строка Из Объект.ОтгружаемыеТовары Цикл
		
		Если ЗначениеЗаполнено(Строка.Серия) И Массив.Найти(Строка.Серия) = Неопределено Тогда
			КоличествоСерий = КоличествоСерий + 1;
			Массив.Добавить(Строка.Серия);
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.КАНАТ_ВсегоСерий = КоличествоСерий;
	
КонецПроцедуры //БИТ_Гурьев_ЧТЗ_2.7_22.02.24--


&НаСервере
&После("ОбработатьУказаниеСерийСервер")
Процедура КАНАТ_ОбработатьУказаниеСерийСервер(ПараметрыФормыУказанияСерий, ИмяТЧ, КэшированныеЗначения)
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
	КАНАТ_ОбновитьКоличествоСерий();
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24--
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ОтгружаемыеТоварыСерияПриИзмененииПосле(Элемент)
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
	КАНАТ_ОбновитьКоличествоСерий();
	//БИТ_Гурьев_ЧТЗ_2.7_22.02.24--
КонецПроцедуры

//БИТ_Гурьев_ЧТЗ_2.7_22.02.24++
&НаСервере
Функция КАНАТ_ПолучитьКоличествоКОтгрузке(Ссылка, Номенклатура, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок) КАК КоличествоУпаковок
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
		|ГДЕ
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &Ссылка
		|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура = &Номенклатура
		|	И РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.КоличествоУпаковок;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции //БИТ_Гурьев_ЧТЗ_2.7_22.02.24--
